## Plan Result (sbox-01-network)




<pre><code>Plan: 38 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_private_dns_zone_virtual_network_link.link[&#34;sandbox.platform.hmcts.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.link[&#34;sbox.platform.hmcts.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;private.postgres.database.azure.com&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.blob.core.windows.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.database.windows.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.datafactory.azure.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.dev.azuresynapse.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.postgres.database.azure.com&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.redis.cache.windows.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.service.signalr.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.servicebus.windows.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.sql.azuresynapse.net&#34;]
  * azurerm_private_dns_zone_virtual_network_link.private_endpoint[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.network.azurerm_route.additional_route[&#34;10_0_0_0&#34;]
  * module.network.azurerm_route.additional_route[&#34;172_16_0_0&#34;]
  * module.network.azurerm_route.additional_route[&#34;192_168_0_0&#34;]
  * module.network.azurerm_route.default_route
  * module.network.azurerm_route_table.route_table
  * module.network.azurerm_subnet.additional_subnets[&#34;api-management&#34;]
  * module.network.azurerm_subnet.additional_subnets[&#34;private-endpoints&#34;]
  * module.network.azurerm_subnet.additional_subnets[&#34;redis&#34;]
  * module.network.azurerm_subnet.additional_subnets[&#34;vh_private_endpoints&#34;]
  * module.network.azurerm_subnet.aks_00_subnet
  * module.network.azurerm_subnet.aks_01_subnet
  * module.network.azurerm_subnet.application_gateway_subnet
  * module.network.azurerm_subnet.iaas_subnet
  * module.network.azurerm_subnet.postgresql_subnet
  * module.network.azurerm_subnet_route_table_association.aks_00
  * module.network.azurerm_subnet_route_table_association.aks_01
  * module.network.azurerm_subnet_route_table_association.iaas
  * module.network.azurerm_subnet_route_table_association.postgresql
  * module.network.azurerm_virtual_network.virtual_network
  * module.vnet_peer_hub_sbox[&#34;ukSouth&#34;].azurerm_virtual_network_peering.initiator-To-target
  * module.vnet_peer_hub_sbox[&#34;ukSouth&#34;].azurerm_virtual_network_peering.target-To-initiator
  * module.vnet_peer_hub_sbox[&#34;ukWest&#34;].azurerm_virtual_network_peering.initiator-To-target
  * module.vnet_peer_hub_sbox[&#34;ukWest&#34;].azurerm_virtual_network_peering.target-To-initiator
  * module.vnet_peer_vpn.azurerm_virtual_network_peering.initiator-To-target
  * module.vnet_peer_vpn.azurerm_virtual_network_peering.target-To-initiator




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_dns_zone_virtual_network_link.link["sandbox.platform.hmcts.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "link" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "sandbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.link["sbox.platform.hmcts.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "link" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "sbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["private.postgres.database.azure.com"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "private.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.blob.core.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.database.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.database.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.datafactory.azure.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.datafactory.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.dev.azuresynapse.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.dev.azuresynapse.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.postgres.database.azure.com"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.redis.cache.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.service.signalr.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.service.signalr.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.servicebus.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.sql.azuresynapse.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.sql.azuresynapse.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_endpoint["privatelink.vaultcore.azure.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_endpoint" {
      + id                    = (known after apply)
      + name                  = "sssbox"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_route.additional_route["10_0_0_0"] will be created
  + resource "azurerm_route" "additional_route" {
      + address_prefix         = "10.0.0.0/8"
      + id                     = (known after apply)
      + name                   = "10_0_0_0"
      + next_hop_in_ip_address = "10.10.200.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "ss-sbox-network-rg"
      + route_table_name       = "aks-sbox-route-table"
    }

  # module.network.azurerm_route.additional_route["172_16_0_0"] will be created
  + resource "azurerm_route" "additional_route" {
      + address_prefix         = "172.16.0.0/12"
      + id                     = (known after apply)
      + name                   = "172_16_0_0"
      + next_hop_in_ip_address = "10.10.200.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "ss-sbox-network-rg"
      + route_table_name       = "aks-sbox-route-table"
    }

  # module.network.azurerm_route.additional_route["192_168_0_0"] will be created
  + resource "azurerm_route" "additional_route" {
      + address_prefix         = "192.168.0.0/16"
      + id                     = (known after apply)
      + name                   = "192_168_0_0"
      + next_hop_in_ip_address = "10.10.200.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "ss-sbox-network-rg"
      + route_table_name       = "aks-sbox-route-table"
    }

  # module.network.azurerm_route.default_route will be created
  + resource "azurerm_route" "default_route" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "default"
      + next_hop_in_ip_address = "10.10.200.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "ss-sbox-network-rg"
      + route_table_name       = "aks-sbox-route-table"
    }

  # module.network.azurerm_route_table.route_table will be created
  + resource "azurerm_route_table" "route_table" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "aks-sbox-route-table"
      + resource_group_name           = "ss-sbox-network-rg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # module.network.azurerm_subnet.additional_subnets["api-management"] will be created
  + resource "azurerm_subnet" "additional_subnets" {
      + address_prefixes                               = [
          + "10.140.33.128/25",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "api-management"
      + resource_group_name                            = "ss-sbox-network-rg"
      + virtual_network_name                           = "ss-sbox-vnet"
    }

  # module.network.azurerm_subnet.additional_subnets["private-endpoints"] will be created
  + resource "azurerm_subnet" "additional_subnets" {
      + address_prefixes                               = [
          + "10.140.36.0/22",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "private-endpoints"
      + resource_group_name                            = "ss-sbox-network-rg"
      + virtual_network_name                           = "ss-sbox-vnet"
    }

  # module.network.azurerm_subnet.additional_subnets["redis"] will be created
  + resource "azurerm_subnet" "additional_subnets" {
      + address_prefixes                               = [
          + "10.140.34.0/25",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "redis"
      + resource_group_name                            = "ss-sbox-network-rg"
      + virtual_network_name                           = "ss-sbox-vnet"
    }

  # module.network.azurerm_subnet.additional_subnets["vh_private_endpoints"] will be created
  + resource "azurerm_subnet" "additional_subnets" {
      + address_prefixes                               = [
          + "10.140.33.0/25",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "vh_private_endpoints"
      + resource_group_name                            = "ss-sbox-network-rg"
      + virtual_network_name                           = "ss-sbox-vnet"
    }

  # module.network.azurerm_subnet.aks_00_subnet will be created
  + resource "azurerm_subnet" "aks_00_subnet" {
      + address_prefixes                               = [
          + "10.140.0.0/20",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "aks-00"
      + resource_group_name                            = "ss-sbox-network-rg"
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "ss-sbox-vnet"
    }

  # module.network.azurerm_subnet.aks_01_subnet will be created
  + resource "azurerm_subnet" "aks_01_subnet" {
      + address_prefixes                               = [
          + "10.140.16.0/20",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "aks-01"
      + resource_group_name                            = "ss-sbox-network-rg"
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "ss-sbox-vnet"
    }

  # module.network.azurerm_subnet.application_gateway_subnet will be created
  + resource "azurerm_subnet" "application_gateway_subnet" {
      + address_prefixes                               = [
          + "10.140.32.128/25",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "aks-appgw"
      + resource_group_name                            = "ss-sbox-network-rg"
      + virtual_network_name                           = "ss-sbox-vnet"
    }

  # module.network.azurerm_subnet.iaas_subnet will be created
  + resource "azurerm_subnet" "iaas_subnet" {
      + address_prefixes                               = [
          + "10.140.32.0/25",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "iaas"
      + resource_group_name                            = "ss-sbox-network-rg"
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "ss-sbox-vnet"
    }

  # module.network.azurerm_subnet.postgresql_subnet will be created
  + resource "azurerm_subnet" "postgresql_subnet" {
      + address_prefixes                               = [
          + "10.140.40.0/25",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "postgresql"
      + resource_group_name                            = "ss-sbox-network-rg"
      + virtual_network_name                           = "ss-sbox-vnet"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.network.azurerm_subnet_route_table_association.aks_00 will be created
  + resource "azurerm_subnet_route_table_association" "aks_00" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.azurerm_subnet_route_table_association.aks_01 will be created
  + resource "azurerm_subnet_route_table_association" "aks_01" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.azurerm_subnet_route_table_association.iaas will be created
  + resource "azurerm_subnet_route_table_association" "iaas" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.azurerm_subnet_route_table_association.postgresql will be created
  + resource "azurerm_subnet_route_table_association" "postgresql" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.azurerm_virtual_network.virtual_network will be created
  + resource "azurerm_virtual_network" "virtual_network" {
      + address_space       = [
          + "10.140.0.0/18",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ss-sbox-vnet"
      + resource_group_name = "ss-sbox-network-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # module.vnet_peer_hub_sbox["ukSouth"].azurerm_virtual_network_peering.initiator-To-target will be created
  + resource "azurerm_virtual_network_peering" "initiator-To-target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hubUkS"
      + remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int"
      + resource_group_name          = "ss-sbox-network-rg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "ss-sbox-vnet"
    }

  # module.vnet_peer_hub_sbox["ukSouth"].azurerm_virtual_network_peering.target-To-initiator will be created
  + resource "azurerm_virtual_network_peering" "target-To-initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "sssbox"
      + remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet"
      + resource_group_name          = "hmcts-hub-sbox-int"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "hmcts-hub-sbox-int"
    }

  # module.vnet_peer_hub_sbox["ukWest"].azurerm_virtual_network_peering.initiator-To-target will be created
  + resource "azurerm_virtual_network_peering" "initiator-To-target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hubUkW"
      + remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/ukw-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/ukw-hub-sbox-int"
      + resource_group_name          = "ss-sbox-network-rg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "ss-sbox-vnet"
    }

  # module.vnet_peer_hub_sbox["ukWest"].azurerm_virtual_network_peering.target-To-initiator will be created
  + resource "azurerm_virtual_network_peering" "target-To-initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "sssbox"
      + remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet"
      + resource_group_name          = "ukw-hub-sbox-int"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "ukw-hub-sbox-int"
    }

  # module.vnet_peer_vpn.azurerm_virtual_network_peering.initiator-To-target will be created
  + resource "azurerm_virtual_network_peering" "initiator-To-target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "vpn"
      + remote_virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
      + resource_group_name          = "ss-sbox-network-rg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "ss-sbox-vnet"
    }

  # module.vnet_peer_vpn.azurerm_virtual_network_peering.target-To-initiator will be created
  + resource "azurerm_virtual_network_peering" "target-To-initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "sssbox"
      + remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet"
      + resource_group_name          = "rg-mgmt"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "core-infra-vnet-mgmt"
    }

Plan: 38 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":232,"Program":"tfcmt","SHA1":"","Target":"sbox-01-network","Vars":{}} -->